// 新增客户数
export const chart1 = [
    {
        name: '新增客户数',
        list: [ // 有3条线，每个数据为一个点（纵坐标）， 每条数据长度一样
            {
                name: '新增客户数',
                type: 'line',
                data: [30, 33, 25, 38, 37 ]
            },
            {
                name: '新增客户群数',
                type: 'line',
                data: [23, 17, 21, 30, 29]
            }
        ],
        // 日期横坐标， 对应上面的点，每条线的点数量和日期数量要一致
        date: ['2021-11-21', '2021-11-22', '2021-11-23', '2021-11-24', '2021-11-25']
    },
    {
        name: '聊天客户数',
        list: [ // 有3条线，每个数据为一个点（纵坐标）， 每条数据长度一样
            {
                name: '新增客户数',
                type: 'line',
                data: [201, 265, 301, 293, 330]
            },
            {
                name: '新增客户群数',
                type: 'line',
                data: [589, 601, 483, 599, 621]
            }
        ],
        // 日期横坐标， 对应上面的点，每条线的点数量和日期数量要一致
        date: ['2021-11-21', '2021-11-22', '2021-11-23', '2021-11-24', '2021-11-25']
    },
    {
        name: '流失客户数',
        list: [ // 有3条线，每个数据为一个点（纵坐标）， 每条数据长度一样
            {
                name: '新增客户数',
                type: 'line',
                data: [9, 7, 6, 8, 6]
            },
            {
                name: '新增客户群数',
                type: 'line',
                data: [11, 8, 5, 13, 5]
            }
        ],
        // 日期横坐标， 对应上面的点，每条线的点数量和日期数量要一致
        date: ['2021-11-21', '2021-11-22', '2021-11-23', '2021-11-24', '2021-11-25']
    }

]

// 折线图2   场景来源趋势
// 新增客户数
export const chart2 = [
    {
        name: '新增客户数',
        list: [ // 有3条线，每个数据为一个点（纵坐标）， 每条数据长度一样
            {
                name: '扫描活码',
                type: 'line',
                data: [15, 16, 9, 17, 18]
            },
            {
                name: '长按图片识别',
                type: 'line',
                data: [2, 3, 3, 4, 4]
            },
            {
                name: '小程序',
                type: 'line',
                data: [8, 12, 7, 10, 13]
            },
            {
                name: '公众号',
                type: 'line',
                data: [5, 2, 6, 7, 2]
            }
        ],
        // 日期横坐标， 对应上面的点，每条线的点数量和日期数量要一致
        date: ['2021-11-21', '2021-11-22', '2021-11-23', '2021-11-24', '2021-11-25']
    },
    {
        name: '活跃用户',
        list: [ // 有3条线，每个数据为一个点（纵坐标）， 每条数据长度一样
            {
                name: '扫描活码',
                type: 'line',
                data: [31, 33, 20, 26, 30]
            },
            {
                name: '长按图片识别',
                type: 'line',
                data: [8, 13, 6, 15, 16]
            },
            {
                name: '小程序',
                type: 'line',
                data: [26, 22, 27, 30, 31]
            },
            {
                name: '公众号',
                type: 'line',
                data: [13, 10, 21, 23, 28]
            }
            
        ],
        // 日期横坐标， 对应上面的点，每条线的点数量和日期数量要一致
        date: ['2021-11-21', '2021-11-22', '2021-11-23', '2021-11-24', '2021-11-25']
    },
    {
        name: '打开次数',
        list: [ // 有3条线，每个数据为一个点（纵坐标）， 每条数据长度一样
            {
                name: '扫描活码',
                type: 'line',
                data: [46, 52, 32, 45, 51]
            },
            {
                name: '长按图片识别',
                type: 'line',
                data: [16, 17, 18, 15, 19]
            },
            {
                name: '小程序',
                type: 'line',
                data: [41, 43, 41, 47, 52]
            },
            {
                name: '公众号',
                type: 'line',
                data: [31, 29, 41, 36, 42]
            }
        ],
        // 日期横坐标， 对应上面的点，每条线的点数量和日期数量要一致
        date: ['2021-11-21', '2021-11-22', '2021-11-23', '2021-11-24', '2021-11-25']
    },
    {
        name: '页面访问次数',
        list: [ // 有3条线，每个数据为一个点（纵坐标）， 每条数据长度一样
            {
                name: '扫描活码',
                type: 'line',
                data: [61, 73, 51, 55, 58]
            },
            {
                name: '长按图片识别',
                type: 'line',
                data: [34, 43, 33, 32, 41]
            },
            {
                name: '小程序',
                type: 'line',
                data: [65, 66, 71, 65, 66]
            },
            {
                name: '公众号',
                type: 'line',
                data: [45, 41, 60, 68, 61]
            }
        ],
        // 日期横坐标， 对应上面的点，每条线的点数量和日期数量要一致
        date: ['2021-11-21', '2021-11-22', '2021-11-23', '2021-11-24', '2021-11-25']
    },
    {
        name: '次均停留时长',
        list: [ // 有3条线，每个数据为一个点（纵坐标）， 每条数据长度一样
            {
                name: '扫描活码',
                type: 'line',
                data: [181, 173, 162, 173, 189]
            },
            {
                name: '长按图片识别',
                type: 'line',
                data: [50, 131, 132, 81, 62]
            },
            {
                name: '小程序',
                type: 'line',
                data: [83, 121, 212, 130, 173]
            },
            {
                name: '公众号',
                type: 'line',
                data: [61, 83, 179, 181, 132]
            }
        ],
        // 日期横坐标， 对应上面的点，每条线的点数量和日期数量要一致
        date: ['2021-11-21', '2021-11-22', '2021-11-23', '2021-11-24', '2021-11-25']
    }
    // {
    //     name: '次均停留时长',
    //     list: [ // 有3条线，每个数据为一个点（纵坐标）， 每条数据长度一样
    //         {
    //             name: '扫描活码',
    //             type: 'line',
    //             data: ['00:03:50', '00:03:01', '00:02:59', '00:01:56', '00:02:21']
    //         },
    //         {
    //             name: '长按图片识别',
    //             type: 'line',
    //             data: ['00:00:49', '00:02:51', '00:02:12', '00:01:21', '00:00;59']
    //         },
    //         {
    //             name: '小程序',
    //             type: 'line',
    //             data: ['00:01:23', '00:02:01', '00:03:32', '00:02:10', '00:02:53']
    //         },
    //         {
    //             name: '公众号',
    //             type: 'line',
    //             data: ['00:01:01', '00:01:20', '00:01:59', '00:01:21', '00:01:50']
    //         }
    //     ],
    //     // 日期横坐标， 对应上面的点，每条线的点数量和日期数量要一致
    //     date: ['2021-11-21', '2021-11-22', '2021-11-23', '2021-11-24', '2021-11-25']
    // }

]

// 饼状图  
// 客户属性
export const pie1 = {
    name: '客户属性',
    data: [
        {
            name: '男', // 块名字
            value: 360,	// 体积
            proportion: '24.83%'
        },
        {
            name: '女', // 块名字
            value: 1056, // 体积
            proportion: '72.83%'
        },
        {
            name: '未知', // 块名字
            value: 34, // 体积
            proportion: '2.34%'
        }
    ]
}

// 饼状图  
// 会员比例
export const pie2 = {
    name: '会员比例',
    data: [
        {
            name: '非会员', // 块名字
            value: 265,	// 体积
            proportion: '18.28%'
        },
        {
            name: '会员', // 块名字
            value: 1185, // 体积
            proportion: '81.72%'
        }
    ]
}

// 新老客看板
export const newOldBord = [
    {
        name: '成交人数(人)',
        list: [ // 有3条线，每个数据为一个点（纵坐标）， 每条数据长度一样
            // {
            //     // list: [81, 98, 76, 152, 163],
                
            // }
            {
                name: '成交人数',
                type: 'line',
                data: [81, 98, 76, 152, 163]
            }
        ],
        // 日期横坐标， 对应上面的点，每条线的点数量和日期数量要一致
        date: ['2021-11-21', '2021-11-22', '2021-11-23', '2021-11-24', '2021-11-25'],
        info: {
            value: 570,
            lastWeek: 6.15
        }
    },
    {
        name: '新客人数(人)',
        list: [ // 有3条线，每个数据为一个点（纵坐标）， 每条数据长度一样
            {
                name: '新客人数',
                type: 'line',
                data: [31, 36, 21, 45, 53]
            }
        ],
        // 日期横坐标， 对应上面的点，每条线的点数量和日期数量要一致
        date: ['2021-11-21', '2021-11-22', '2021-11-23', '2021-11-24', '2021-11-25'],
        info: {
            value: 186,
            lastWeek: 2.03
        }
    },
    {
        name: '老客人数(人)',
        list: [ // 有3条线，每个数据为一个点（纵坐标）， 每条数据长度一样
            {
                name: '老客人数',
                type: 'line',
                data: [50, 62, 55, 107, 110]
            }
        ],
        // 日期横坐标， 对应上面的点，每条线的点数量和日期数量要一致
        date: ['2021-11-21', '2021-11-22', '2021-11-23', '2021-11-24', '2021-11-25'],
        info: {
            value: 384,
            lastWeek: 3.21
        }
    }
]

// 饼状图  
// 新老客看板
export const newOldPie = {
    name: '新老客',
    data: [
        {
            name: '新客', // 块名字
            value: 186,	// 体积
            proportion: '32.63%'
        },
        {
            name: '老客', // 块名字
            value: 384, // 体积
            proportion: '67.37%'
        }
    ]
}

// ====重复购买===========
export const repeatList = [
    {
        name: '复购人数',
        list: [ // 有3条线，每个数据为一个点（纵坐标）， 每条数据长度一样
            {
                name: '复购人数',
                type: 'line',
                data: [184, 172, 175, 201, 235]
            }
        ],
        // 日期横坐标， 对应上面的点，每条线的点数量和日期数量要一致
        date: ['1025-1031', '1101-1107', '1108-1114', '1115-1121', '1122-1128'],
        info: {
            value: 967,
            lastWeek: 3.32
        }
    },
    {
        name: '复购新客(人)',
        list: [ // 有3条线，每个数据为一个点（纵坐标）， 每条数据长度一样
            {
                name: '复购新客',
                type: 'line',
                data: [63, 68, 73, 65, 79]
            }
        ],
        // 日期横坐标， 对应上面的点，每条线的点数量和日期数量要一致
        date: ['1025-1031', '1101-1107', '1108-1114', '1115-1121', '1122-1128'],
        info: {
            value: 348,
            lastWeek: 2.89
        }
    },
    {
        name: '复购老客(人)',
        list: [ // 有3条线，每个数据为一个点（纵坐标）， 每条数据长度一样
            {
                name: '复购老客',
                type: 'line',
                data: [97, 121, 102, 130, 169]
            }
        ],
        // 日期横坐标， 对应上面的点，每条线的点数量和日期数量要一致
        date: ['1025-1031', '1101-1107', '1108-1114', '1115-1121', '1122-1128'],
        info: {
            value: 619,
            lastWeek: 4.32
        }
    }
]